# Apply

In [1]:
import pandas as pd

## Primer

In [2]:
df = pd.DataFrame(
    {
        "Name": ["John", "Rock", "Neil", "Tom"],
        "Group": [
            "A",
            "A",
            "B",
            "B",
        ],
        "Marks": [78, 66, 55, 42],
    }
)
display(df)

   Name Group  Marks
0  John     A     78
1  Rock     A     66
2  Neil     B     55
3   Tom     B     42

In [3]:
# Create a new column "Marks (%)" which contains the marks in percentage
def make_percent(val):
    return str(val) + "%"


df["Marks (%)"] = df["Marks"].apply(make_percent)

display(df)

   Name Group  Marks Marks (%)
0  John     A     78       78%
1  Rock     A     66       66%
2  Neil     B     55       55%
3   Tom     B     42       42%

In [4]:
# Create a new column "Pass" which contains True if the student has passed the exam, False otherwise
# A student is considered to be passed if he/she has scored 70 or more marks in group A and 50 or more marks in group B.


def is_pass(row):
    group = row["Group"]
    marks = row["Marks"]
    if group == "A":
        return marks >= 70
    else:
        return marks >= 50


df["Pass"] = df.apply(is_pass, axis=1)
display(df)

   Name Group  Marks Marks (%)   Pass
0  John     A     78       78%   True
1  Rock     A     66       66%  False
2  Neil     B     55       55%   True
3   Tom     B     42       42%  False

## Real Data

In [5]:
df_raw = pd.read_csv("./data/student_mat.csv")
df_raw.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

In [6]:
df_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 33 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      395 non-null    object
 1   sex         395 non-null    object
 2   age         395 non-null    int64
 3   address     395 non-null    object
 4   famsize     395 non-null    object
 5   Pstatus     395 non-null    object
 6   Medu        395 non-null    int64
 7   Fedu        395 non-null    int64
 8   Mjob        395 non-null    object
 9   Fjob        395 non-null    object
 10  reason      395 non-null    object
 11  guardian    395 non-null    object
 12  traveltime  395 non-null    int64
 13  studytime   395 non-null    int64
 14  failures    395 non-null    int64
 15  schoolsup   395 non-null    object
 16  famsup      395 non-null    object
 17  paid        395 non-null    object
 18  activities  395 non-null    object
 19  nursery     395 non-null    object
 20  higher      395 non-null    object
 21  internet    395 non-null    object
 22  romantic    395 non-null    object
 23  famrel      395 non-null    int64
 24  freetime    395 non-null    int64
 25  goout       395 non-null    int64
 26  Dalc        395 non-null    int64
 27  Walc        395 non-null    int64
 28  health      395 non-null    int64
 29  absences    395 non-null    int64
 30  G1          395 non-null    int64
 31  G2          395 non-null    int64
 32  G3          395 non-null    int64
dtypes: int64(16), object(17)
memory usage: 102.0+ KB

In [7]:
# For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column
df_stu = df_raw.loc[:, "school":"guardian"]
df_stu.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father

In [8]:
# Create a function that will capitalize strings
def capitalizer(val):
    return val.upper()


df_stu["Mjob"] = df_stu["Mjob"].apply(capitalizer)
df_stu["Fjob"] = df_stu["Fjob"].apply(capitalizer)

df_stu.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father
2,GP,F,15,U,LE3,T,1,1,AT_HOME,OTHER,other,mother
3,GP,F,15,U,GT3,T,4,2,HEALTH,SERVICES,home,mother
4,GP,F,16,U,GT3,T,3,3,OTHER,OTHER,home,father

In [9]:
# Create a function called majority that returns a boolean value to a new column called legal_drinker
def is_legan_drinker(x):
    if x > 17:
        return True
    else:
        return False


df_stu["legal_drinker"] = df_stu["age"].apply(is_legan_drinker)
df_stu.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother,True
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father,False
2,GP,F,15,U,LE3,T,1,1,AT_HOME,OTHER,other,mother,False
3,GP,F,15,U,GT3,T,4,2,HEALTH,SERVICES,home,mother,False
4,GP,F,16,U,GT3,T,3,3,OTHER,OTHER,home,father,False

In [10]:
# Create a new column called category that will be calculated based on the age and sex of each student.
def categorize_by_age_and_sex(row):
    sex = row["sex"]
    age = row["age"]
    if age < 18:
        if sex == "F":
            return "Underage Female"
        else:
            return "Underage Male"
    else:
        if sex == "F":
            return "Adult Female"
        else:
            return "Adult Male"


df_stu["category"] = df_stu.apply(categorize_by_age_and_sex, axis=1)

df_stu[["sex", "age", "category"]].head(10)

  sex  age         category
0   F   18     Adult Female
1   F   17  Underage Female
2   F   15  Underage Female
3   F   15  Underage Female
4   F   16  Underage Female
5   M   16    Underage Male
6   M   16    Underage Male
7   F   17  Underage Female
8   M   15    Underage Male
9   M   15    Underage Male

In [14]:
df_stu.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker,category
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother,True,Adult Female
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father,False,Underage Female
2,GP,F,15,U,LE3,T,1,1,AT_HOME,OTHER,other,mother,False,Underage Female
3,GP,F,15,U,GT3,T,4,2,HEALTH,SERVICES,home,mother,False,Underage Female
4,GP,F,16,U,GT3,T,3,3,OTHER,OTHER,home,father,False,Underage Female

In [15]:
df_stu_group = df_stu.groupby("category")

In [16]:
df_stu_group.size()

category
Adult Female        58
Adult Male          53
Underage Female    150
Underage Male      134
dtype: int64

In [17]:
df_stu_group.nunique()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
category,,,,,,,,,,,,,
Adult Female,2,1,3,2,2,2,5,4,5,5,4,3,1
Adult Male,2,1,5,2,2,2,4,4,5,5,4,3,1
Underage Female,2,1,3,2,2,2,5,4,5,5,4,3,1
Underage Male,2,1,3,2,2,2,5,5,5,5,4,3,1